#### GetEnumerator Method

---

|  |
| --- |
| DuctSizes Class   See Also |

Returns an enumerator that iterates through a collection.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public virtual IEnumerator<MEPSize> GetEnumerator() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function GetEnumerator As IEnumerator(Of MEPSize) ``` |

| Visual C++ |
| --- |
| ``` public: virtual IEnumerator<MEPSize^>^ GetEnumerator() ``` |

#### Return Value

An IEnumerator object that can be used to iterate through the collection.

#### Implements

 IEnumerable T GetEnumerator

# See Also

DuctSizes Class

Autodesk.Revit.DB.Mechanical Namespace